package com.osbblevymista.telegram.system;


import lombok.AllArgsConstructor;
import lombok.Getter;

@AllArgsConstructor
@Getter
public enum Titles {

    SETTINGS("""
            <u>Налаштування.</u>
            Для того, щоб ввести дані, будь ласка натисніть спочатку відповідну кнопку, пізніше вводьте та надсилайте дані.
            """),
    CONTACTS("""
            <u>Контакти</u>
            Тут Ви знайдете контактні дані основних працівників нашого ОСББ.
            """),
    CHATS("<u>Чати</u>"),
    APPEAL("<u>Звернення</u>"),
    APPEAL_SIMPLE("<u>Звичайте звернення</u>"),
    SEND_MESSAGE("<u>Створити та розіслати повідомлення</u>"),
    APPEAL_URGENT("<u>Термінове звернення</u>"),
    ARREARS("<u>Заборгованість</u>"),
    INFO("""
            <u>Інформація</u>
            Даний бот розробляється цілком безкоштовно, тому інколи можуть виникати проблеми в його роботі.
            Завчасно просимо вибачення за це. Ми будемо виправляти помилки, удосконалювати та впроваджувати новий функціонал як найшвидше.
            Також Ви дуже допоможете нам, якщо виявите некоректну роботу бота та повідомите про неї.
                
            На цій сторінці Ви знайдете контактні дані та документи які стосуються нашого ОСББ.
            """),
    MAIN("Ви перейшли на головну сторінку."), //змінити текст і доставити іконку клави
    ADMIN("<u>Адмін</u>\n"),
    REPORTS("""
            <u>Документи та звіти</u>
            Тут знаходяться основні звіти та документи які стосуються роботи нашого ОСББ.
            """);

    private String title;
}
