package com.osbblevymista.system;

import lombok.AllArgsConstructor;
import lombok.Getter;

@AllArgsConstructor
@Getter
public enum Messages {
    MISSING_LOG_AND_PASS(100, """
            Відсутній логін та пароль до сисеми МійДім. Будь ласка перейдіть в налаштування на добавте Логін та Пароль.\s
            Якщо у вас нема доступу до системи МійДім перейдіть будь ласка за посилання https://miydimonline.com.ua/ та зареєструйтесь.
            Якщо у вас виникнули труднощі із реєстрацією зверніться будь ласка до правління ОСББ.
            """),

    INSERT_LOGIN(101, "Будь ласка введіть логін до системи МійДім\n"),
    INSERT_PASS(102, "Будь ласка введіть пароль до системи МійДім\n"),
    GETTING_ARREARS_DATA_FROM_MYIDIM(103, "Отримую дані про заборгованість. Зазвичай це займає до 1хв.\n"),
    CONTACT_HEAD_OF_OSBB(104, """
            <b>ПІП: </b>
            Дзяма Василь Васильович
            <b>Номер телефону: </b>
            068-008-14-55
            <b>Прийомні години: </b> 
            Пн, Ср, Пт: 18.00-19.00
            Нд:               вихідний
            """),
    CONTACT_ACCOUNTANT(105, """
            <b>ПІП: </b>
            Коваленко Арсеній Олександрович
            <b>Номер телефону: </b>
            067-641-73-11
            <b>Прийомні години: </b>
            Вт, Ср: 15.00-18.00
            Сб:       12.00-15.00
            Нд:       вихідний
            """),

    CONTACT_BUTTON_WORKER(106, """
            <b>ПІП: </b>
            Маїк Юрій Михайлович
            <b>Номер телефону: </b>
            097-979-90-99
            <b>Прийомні години:</b>
            Вт,Ср: 15.00-18.00
            Сб:       12.00-15.00
            Нд:       вихідний
            """),

    CONTACT_BUTTON_SECURITY(106, """
            <b>Номер телефону: </b> 
            050-69-28-470
            <b>Прийомні години: </b> 
            цілодобово
            """),

    INSERT_SIMPLE_REQUEST_DATA_FOR_MYIDIM(107, """
            Введіть будь ласка Ваш запит.
            Формування звернення зазвичай займає до 1хв. Дочекайтесь будь ласка відповіді.
            Звернення опрацьовується правлінням протягом 3х робочих днів.
            """),

    CREATING_REQUEST_DATA_FOR_MYIDIM(108, "Створюю запит. Зазвичай це займає до 1хв.\n"),

    RESPONSE_SIMPLE_REQUEST_DATA_FOR_MYIDIM(109, "Ви створили нове звернення. " +
            "Ми опрацюємо його як найшвидше. " +
            "Для перевірки статусу перейдіть у розділ '" + Actions.BUTTON_APPEAL_REVIEW.getText() + "'"),

    RESPONSE_URGENT_REQUEST_DATA_FOR_MYIDIM(111, "Ви створили терміновий запит. " +
            "Ми опрацюємо його протягом одного дня. " +
            "Для перевірки статусу перейдіть у розділ  '" + Actions.BUTTON_APPEAL_REVIEW.getText() + "'"),

    RESPONSE_ERROR_REQUEST_DATA_FOR_MYIDIM(112, "Уппс, щось трапилось. " +
            "Запит не був творений. Попробуйте трохи пізніше, або зверніться до правління ОСББ."),

    INSERT_URGENT_REQUEST_DATA_FOR_MYIDIM(113, """
            Введіть будь ласка Ваш запит.
            Формування звернення зазвичай займає до 1хв. Дочекайтесь будь ласка відповіді.
            Звернення опрацьовується правлінням протягом одного дня.
            """),

    GET_REQUEST_DATA_FOR_MYIDIM(114, """
            Отримую інформацію по Ваших зверненнях. Зазвичай це займає до 1хв.
            """),

    CHATS_BASE(115, """
            OSBBLevyMista_теревені - призначений для обговорення питань, проблем та життєдіяльності ЖК \"Леви Міста\".
            OSBBLevyMista_купи - призначений для оголошень купівлі, продажу, оренди майна та надання послуг мешканцями ЖК \"Леви Міста\".
            """),

    CHATS_BOARD(116, """
            ВІТАЮ! 
            Якщо ви бачите це повідомлення тоді ви один із членів правління ЖК і у вас є доступ до чату правління.
            """),

    POLL(117, """
            Нижче знаходяться список інформаційних форм, заповнення яких надасть інформацію правлінню ОСББ швидше та якісніше обробляти Ваші запити.
            Якщо потрібно надіслати індивідуальний запит, будь ласка натисніть кнопнку \"Створити звичайне\" чи \"Створити термінове\" та надішліть текст.
            """),

    SENT_MESSAGE_TO_ALL(118, """
            Введіть повідомлення яке буде розіслане всім користувачам.
            """),

    DEFAULT_ANSWER(119, "Мені дуже шкода, але на даний момент я не маю відповіді!"),

    REPORTS(120, "Тут ви знайдете документи та звіти ОСББ \'Леви Міста\'."),
    NEW_MESSAGE_NOTIFICATION_BOARD(121, "НОВЕ ЗВЕРНЕННЯ!!!"),
    START_NEW_PERSON(122, """
            ВІТАЮ!!!
            Для отримання всієї інформації яку надає Telegram bot бот, <b>будь ласка</b> зробіть наступне:
            
            1. Заповніть <b>Логін</b> та <b>Пароль</b> від системи <b>МійДім</b>(<i>https://miydimonline.com.ua/</i>) в розділі <u>Налаштування</u>;
            
            2. Налаштуйте <b>Ім'я користувача</b> / <b>Username</b> у розділі налаштуваня Telegram (<u>Налаштування</u> / <u>Settings</u> -> <u>Редагувати Профайл</u> / <u>Edit Profile</u> -> <u>Ім'я користувача / Username</u>).
            """),
    SUCCESS_INSERT_LOGIN(123, """
            Ви успішно ввели логін. 
            """),
    SUCCESS_INSERT_PASS(123, """
            Ви успішно ввели пароль. 
            """),

    SEND_OUT_NEW_RECEIPT(124, """
            Розсилаю інвормацію про квитанції.
            """),

    NEW_RECEIPT_INFO(125, """
            <b>Вам нарахована нова квитанція за оплату ОСББ.</b>
            Будь Ласка перейдіть у розділ <u>""" + Actions.BUTTON_ARREARS.getText() +
            "</u> та оплатіть послугу\n");

    Integer id;
    String message;

}
